Autodesk.Navisworks.Api.Data.NavisWorksDataReader
Implementation of DbDataReader.

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.Close
Closes the datareader.

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.Depth
Not implemented.  Returns 0

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.FieldCount
Returns the number of columns in the current resultset.

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetBoolean(System.Int32)
Retrieves the column as a boolean value
ordinal: The index of the column to retrieve
Returns: bool

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetByte(System.Int32)
Retrieves the column as a single byte value
ordinal: The index of the column to retrieve
Returns: byte

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetBytes(System.Int32,System.Int64,System.Byte[],System.Int32,System.Int32)
Retrieves a column as an array of bytes (blob).
To determine the number of bytes in the column, pass a null value for the buffer.The total length will be returned.
ordinal: The index of the column to retrieve
dataOffset: The zero-based index of where to begin reading the data
buffer: The buffer to write the bytes into
bufferOffset: The zero-based index of where to begin writing into the array
length: The number of bytes to retrieve
Returns: The actual number of bytes written into the array, if buffer is null, will return total length

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetChar(System.Int32)
Returns the column as a single character
ordinal: The index of the column to retrieve
Returns: char

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetChars(System.Int32,System.Int64,System.Char[],System.Int32,System.Int32)
Retrieves a column as an array of chars (blob)
To determine the number of characters in the column, pass a null value for the buffer.  The total length will be returned.
ordinal: The index of the column to retrieve
dataOffset: The zero-based index of where to begin reading the data
buffer: The buffer to write the characters into
bufferOffset: The zero-based index of where to begin writing into the array
length: The number of bytes to retrieve
Returns: The actual number of bytes written into the array, if buffer is null, will return total length

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetDataTypeName(System.Int32)
Retrieves the name of the back-end datatype of the column
ordinal: The index of the column to retrieve
Returns: string

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetDateTime(System.Int32)
Retrieve the column as a date/time value
ordinal: The index of the column to retrieve
Returns: DateTime

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetDecimal(System.Int32)
Retrieve the column as a decimal value
ordinal: The index of the column to retrieve
Returns: decimal

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetDouble(System.Int32)
Returns the column as a double
ordinal: The index of the column to retrieve
Returns: double

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetFieldType(System.Int32)
Returns the .NET type of a given column
ordinal: The index of the column to retrieve
Returns: Type

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetFloat(System.Int32)
Returns a column as a float value
ordinal: The index of the column to retrieve
Returns: float

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetGuid(System.Int32)
Returns the column as a Guid
ordinal: The index of the column to retrieve
Returns: Guid

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetInt16(System.Int32)
Returns the column as a short
ordinal: The index of the column to retrieve
Returns: Int16

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetInt32(System.Int32)
Retrieves the column as an int
ordinal: The index of the column to retrieve
Returns: Int32

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetInt64(System.Int32)
Retrieves the column as a long
ordinal: The index of the column to retrieve
Returns: Int64

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetName(System.Int32)
Retrieves the name of the column
ordinal: The index of the column to retrieve
Returns: string

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetOrdinal(System.String)
Retrieves the index of a column, given its name
name: The name of the column to retrieve
Returns: The int index of the column

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetSchemaTable
Schema information in SQLite is difficult to map into .NET conventions, so a lot of work must be done
to gather the necessary information so it can be represented in an ADO.NET manner.
Returns: Returns a DataTable containing the schema information for the active SELECT statement being processed.

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetString(System.Int32)
Retrieves the column as a string
ordinal: The index of the column to retrieve
Returns: string

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetValue(System.Int32)
Retrieves the column as an object corresponding to the underlying datatype of the column
ordinal: The index of the column to retrieve
Returns: object

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.GetValues(System.Object[])
Retrieves the values of multiple columns, up to the size of the supplied array
values: The array to fill with values from the columns in the current resultset
Returns: The number of columns retrieved

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.HasRows
Returns True if the resultset has rows that can be fetched

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.IsClosed
Returns True if the data reader is closed

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.IsDBNull(System.Int32)
Returns True if the specified column is null
ordinal: The index of the column to retrieve
Returns: True or False

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.Item(System.Int32)
Indexer to retrieve data from a column given its i
index: The index of the column to retrieve
Returns: The value contained in the column

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.Item(System.String)
Indexer to retrieve data from a column given its name
name: The name of the column to retrieve data for
Returns: The value contained in the column

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.NextResult
Moves to the next resultset in multiple row-returning SQL command.
Returns: True if the command was successful and a new resultset is available, False otherwise.
Throws Autodesk.Navisworks.Api.Data.DatabaseException:
Database exception

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.Read
Reads the next row from the resultset
Returns: True if a new row was successfully loaded and is ready for processing

Autodesk.Navisworks.Api.Data.NavisWorksDataReader.RecordsAffected
Retrieve the count of records affected by an update/insert/delete command.  Only valid once the data reader is closed!